---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar
source: html/2453335a-e52f-603d-8a94-128a2c0ddf35.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar

Defines parameters for Round Bar structural section.

## Syntax (C#)
```csharp
public class StructuralSectionRoundBar : StructuralSectionGeneralS
```